// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
 // Элементы массива вводятся пользователем.

int[] myArray;
myArray = new int [8];
Console.WriteLine("Введите число: ");

for (int i = 0; i < myArray.Length; i++)
{
    myArray[i] = Convert.ToInt32(Console.ReadLine());
}

// Задача №29 не решена!!!



   















